---
kind: method
id: M:Autodesk.Revit.DB.LayoutRuleMaximumSpacing.#ctor(System.Double)
source: html/50fa954b-f41a-78a3-2596-58e75499be2a.htm
---
# Autodesk.Revit.DB.LayoutRuleMaximumSpacing.#ctor Method

Constructor of LayoutRuleMaximumSpacing.

## Syntax (C#)
```csharp
public LayoutRuleMaximumSpacing(
	double spacing
)
```

## Parameters
- **spacing** (`System.Double`) - The value of spacing must be in (0, 30000).

## Remarks
The value of spacing must be in (0, 30000), but in fact the spacing
should not be too small or too great.